app/views/home/index.html.haml

  %p.lead
    InvoiceMe is a web based invoice management service which has several hundred customers.Customers can create and send invoices to their clients via the simple online invoice management solution of InvoiceMe.
- if user_signed_in? and !current_user.owned_businesses.any?
  .jumbotron
---
SELECT 1 AS one FROM `businesses` WHERE `businesses`.`user_id` = 2 LIMIT 1