app/controllers/businesses_controller.rb

  def create
    @business = current_user.businesses.new(business_params)
    # @business.businesses_users.create
    respond_to do |format|
      if @business.save
---
INSERT INTO `businesses` (`created_at`, `description`, `logo_content_type`, `logo_file_name`, `logo_file_size`, `logo_updated_at`, `name`, `owner_id`, `updated_at`) VALUES ('2014-07-10 09:50:38', 'This is for testing purpose', 'image/png', 'logo.png', 6900, '2014-07-10 09:50:38', 'Jyothu’s Company', '1', '2014-07-10 09:50:38')

  def invoice
    @business = current_user.businesses.find(params[:business_id])
---
SELECT `businesses`.* FROM `businesses` INNER JOIN `businesses_users` ON `businesses`.`id` = `businesses_users`.`business_id` WHERE `businesses_users`.`user_id` = 2 AND `businesses`.`id` = 4 LIMIT 1

    def set_business
      @business = Business.find(params[:id])
---
SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 2 LIMIT 1