app/controllers/invitations_controller.rb

  def new
    @business = Business.find(params["business_id"])
---
SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 3 ORDER BY `businesses`.`id` ASC LIMIT 1

  def create
    @business = Business.find(params["business_id"])
    @businesses = current_user.businesses
    @invitation = @business.invitations.new(invitation_params)

    respond_to do |format|
      if @invitation.save
---
SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 4 ORDER BY `businesses`.`id` ASC LIMIT 1
INSERT INTO `invitations` (`business_id`, `created_at`, `email`, `name`, `updated_at`) VALUES (4, '2014-07-10 11:27:29', 'jyothish.kumar@compassitesinc.com', 'Jyothish Kumar K R', '2014-07-10 11:27:29')

    def set_invitation
      @invitation = Invitation.find(params[:id])
---
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`id` = 1 LIMIT 1