app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `name`, `updated_at`) VALUES ('2014-06-21 09:19:15', 'jyothu.kr@gmail.com', '$2a$10$pdFXKaHckwzHAANRonUbzuLsgy16O2U5FxWlEySKtBWwOAYoUoGP2', 'Jyothu Mannarkkad', '2014-06-21 09:19:15')
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`email` = 'jyothish.kumar@compassitesinc.com'
SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 4 ORDER BY `businesses`.`id` ASC LIMIT 1
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
        invitations = Invitation.where(:email => @user.email)
        invitations.each{|invitation| @user.businesses << invitation.business}